# Inroduction To Pandas...

In [3]:
import pandas as pd

# DatatypeOne: Series

    >_  Series are One-Dimensional, (axis-1)...

In [4]:
SpaceCompanies = pd.Series(["ASAI Inc.", "NASA", "SpaceX", "Blue Origin", "Axiom Space"])

In [5]:
SpaceCompanies

0      ASAI Inc.
1           NASA
2         SpaceX
3    Blue Origin
4    Axiom Space
dtype: object

In [6]:
Projects = pd.Series(["Project-Humanoid", "ARTEMIS Generation", "Project-Starship", "Blue Moon", "ISS Research Facilities"])

In [7]:
Projects

0           Project-Humanoid
1         ARTEMIS Generation
2           Project-Starship
3                  Blue Moon
4    ISS Research Facilities
dtype: object

# DatatypeTwo: DataFrame

     >_ DataFrames are Two-Dimensional, (axis-0 & axis-1)...

In [8]:
Progress = pd.DataFrame({"Space Companies": SpaceCompanies, "Project": Projects})
Progress

  Space Companies                  Project
0       ASAI Inc.         Project-Humanoid
1            NASA       ARTEMIS Generation
2          SpaceX         Project-Starship
3     Blue Origin                Blue Moon
4     Axiom Space  ISS Research Facilities

# Importing data...

In [9]:
CarData = pd.read_csv("car-sales.csv")

In [10]:
CarData

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

    >_  (.csv) files are the standard of data files in AI & ML...

    >_  You can also provide an URL of the ".csv" file in the FileName parameter...

In [11]:
HeartPatient = pd.read_csv("heart-disease.csv")

In [12]:
HeartPatient

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

    >_  The files should be in the same directory as source...

# Exporting DataFrame...

In [13]:
CarData.to_csv("Updated-Car-Data.csv", index = False)

    >_ You can export into many file formats like as, excel files[VariableName.to_FileType("NewFileName", index=False)]...

Verify file export...

In [14]:
UpdatedCarData = pd.read_csv("Updated-Car-Data.csv")

In [15]:
UpdatedCarData

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

    >_  If you'll not include [index=False], the exported data's index will be messed up!

# Describing the data...

### Attribute

In [18]:
CarData.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

### Function

    >_   CarData.to_csv()

In [20]:
CarColumns = CarData.columns
CarColumns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [21]:
CarIndex = CarData.index
CarIndex

RangeIndex(start=0, stop=10, step=1)

In [22]:
CarData.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [23]:
CarData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [25]:
CarData.mean()

<ipython-input-25-a160645d338d>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  CarData.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

### Average  \  Mean

In [29]:
CarPrices = pd.Series([3200, 4500, 3245, 4532])
CarPrices.mean()

3869.25

In [30]:
CarPrices.sum()

15477

In [31]:
CarData.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [32]:
CarData["Doors"].sum()

40

In [33]:
CarData["Price"].sum()

'$4,000.00$5,000.00$7,000.00$22,000.00$3,500.00$4,500.00$7,500.00$7,000.00$6,250.00$9,700.00'

In [35]:
CarData["Odometer (KM)"].sum()

786014

In [36]:
len(CarData)

10

In [37]:
CarData

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# Selecting & Viewing Data

    >_   The First Five...

In [38]:
CarData.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [39]:
CarData.head(3)

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

    >_   The Last Five...

In [41]:
CarData.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [42]:
CarData.tail(7)

     Make Colour  Odometer (KM)  Doors       Price
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## .loc & .iloc